TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v18.1.3.LTS *
       3                    ;* Date/Time created: Thu Dec 13 17:43:17 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/sensor.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v18.1.3.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Volpone\Dropbox\CPE 403 - 1001\CC1350\sensor_cc1350
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    8190                            .dwattr $C$DW$707, DW_AT_decl_column(0x04)
    8191                    
    8192                    $C$DW$708       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  151

    8193                            .dwattr $C$DW$708, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    8194                            .dwattr $C$DW$708, DW_AT_const_value(0xe5)
    8195                            .dwattr $C$DW$708, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8196                            .dwattr $C$DW$708, DW_AT_decl_line(0x3e8)
    8197                            .dwattr $C$DW$708, DW_AT_decl_column(0x04)
    8198                    
    8199                            .dwattr $C$DW$T$585, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8200                            .dwattr $C$DW$T$585, DW_AT_decl_line(0x3dc)
    8201                            .dwattr $C$DW$T$585, DW_AT_decl_column(0x01)
    8202                            .dwendtag $C$DW$T$585
    8203                    
    8204                    $C$DW$T$586     .dwtag  DW_TAG_typedef
    8205                            .dwattr $C$DW$T$586, DW_AT_name("ICall_RemotiCmdEvent_t")
    8206                            .dwattr $C$DW$T$586, DW_AT_type(*$C$DW$T$585)
    8207                            .dwattr $C$DW$T$586, DW_AT_language(DW_LANG_C)
    8208                            .dwattr $C$DW$T$586, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8209                            .dwattr $C$DW$T$586, DW_AT_decl_line(0x3e9)
    8210                            .dwattr $C$DW$T$586, DW_AT_decl_column(0x02)
    8211                    
    8212                    
    8213                    $C$DW$T$587     .dwtag  DW_TAG_enumeration_type
    8214                            .dwattr $C$DW$T$587, DW_AT_byte_size(0x01)
    8215                    $C$DW$709       .dwtag  DW_TAG_enumerator
    8216                            .dwattr $C$DW$709, DW_AT_name("PIN_SUCCESS")
    8217                            .dwattr $C$DW$709, DW_AT_const_value(0x00)
    8218                            .dwattr $C$DW$709, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    8219                            .dwattr $C$DW$709, DW_AT_decl_line(0x2cd)
    8220                            .dwattr $C$DW$709, DW_AT_decl_column(0x05)
    8221                    
    8222                    $C$DW$710       .dwtag  DW_TAG_enumerator
    8223                            .dwattr $C$DW$710, DW_AT_name("PIN_ALREADY_ALLOCATED")
    8224                            .dwattr $C$DW$710, DW_AT_const_value(0x01)
    8225                            .dwattr $C$DW$710, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    8226                            .dwattr $C$DW$710, DW_AT_decl_line(0x2ce)
    8227                            .dwattr $C$DW$710, DW_AT_decl_column(0x05)
    8228                    
    8229                    $C$DW$711       .dwtag  DW_TAG_enumerator
    8230                            .dwattr $C$DW$711, DW_AT_name("PIN_NO_ACCESS")
    8231                            .dwattr $C$DW$711, DW_AT_const_value(0x02)
    8232                            .dwattr $C$DW$711, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    8233                            .dwattr $C$DW$711, DW_AT_decl_line(0x2cf)
    8234                            .dwattr $C$DW$711, DW_AT_decl_column(0x05)
    8235                    
    8236                    $C$DW$712       .dwtag  DW_TAG_enumerator
    8237                            .dwattr $C$DW$712, DW_AT_name("PIN_UNSUPPORTED")
    8238                            .dwattr $C$DW$712, DW_AT_const_value(0x03)
    8239                            .dwattr $C$DW$712, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    8240                            .dwattr $C$DW$712, DW_AT_decl_line(0x2d0)
    8241                            .dwattr $C$DW$712, DW_AT_decl_column(0x05)
    8242                    
    8243                            .dwattr $C$DW$T$587, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    8244                            .dwattr $C$DW$T$587, DW_AT_decl_line(0x2cc)
    8245                            .dwattr $C$DW$T$587, DW_AT_decl_column(0x0e)
    8246                            .dwendtag $C$DW$T$587
    8247                    
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  152

    8248                    $C$DW$T$588     .dwtag  DW_TAG_typedef
    8249                            .dwattr $C$DW$T$588, DW_AT_name("PIN_Status")
    8250                            .dwattr $C$DW$T$588, DW_AT_type(*$C$DW$T$587)
    8251                            .dwattr $C$DW$T$588, DW_AT_language(DW_LANG_C)
    8252                            .dwattr $C$DW$T$588, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    8253                            .dwattr $C$DW$T$588, DW_AT_decl_line(0x2d1)
    8254                            .dwattr $C$DW$T$588, DW_AT_decl_column(0x03)
    8255                    
    8256                    
    8257                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    8258                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    8259                    $C$DW$713       .dwtag  DW_TAG_member
    8260                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$95)
    8261                            .dwattr $C$DW$713, DW_AT_name("addr")
    8262                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("addr")
    8263                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8264                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    8265                            .dwattr $C$DW$713, DW_AT_decl_file("..\Application\api_mac.h")
    8266                            .dwattr $C$DW$713, DW_AT_decl_line(0x4db)
    8267                            .dwattr $C$DW$713, DW_AT_decl_column(0x07)
    8268                    
    8269                    $C$DW$714       .dwtag  DW_TAG_member
    8270                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$22)
    8271                            .dwattr $C$DW$714, DW_AT_name("addrMode")
    8272                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("addrMode")
    8273                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8274                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    8275                            .dwattr $C$DW$714, DW_AT_decl_file("..\Application\api_mac.h")
    8276                            .dwattr $C$DW$714, DW_AT_decl_line(0x4de)
    8277                            .dwattr $C$DW$714, DW_AT_decl_column(0x17)
    8278                    
    8279                            .dwattr $C$DW$T$23, DW_AT_decl_file("..\Application\api_mac.h")
    8280                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4d0)
    8281                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    8282                            .dwendtag $C$DW$T$23
    8283                    
    8284                    $C$DW$T$372     .dwtag  DW_TAG_typedef
    8285                            .dwattr $C$DW$T$372, DW_AT_name("ApiMac_sAddr_t")
    8286                            .dwattr $C$DW$T$372, DW_AT_type(*$C$DW$T$23)
    8287                            .dwattr $C$DW$T$372, DW_AT_language(DW_LANG_C)
    8288                            .dwattr $C$DW$T$372, DW_AT_decl_file("..\Application\api_mac.h")
    8289                            .dwattr $C$DW$T$372, DW_AT_decl_line(0x4df)
    8290                            .dwattr $C$DW$T$372, DW_AT_decl_column(0x03)
    8291                    
    8292                    $C$DW$T$589     .dwtag  DW_TAG_pointer_type
    8293                            .dwattr $C$DW$T$589, DW_AT_type(*$C$DW$T$372)
    8294                            .dwattr $C$DW$T$589, DW_AT_address_class(0x20)
    8295                    
    8296                    $C$DW$T$590     .dwtag  DW_TAG_const_type
    8297                            .dwattr $C$DW$T$590, DW_AT_type(*$C$DW$T$589)
    8298                    
    8299                    
    8300                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    8301                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x40)
    8302                    $C$DW$715       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  153

    8303                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$25)
    8304                            .dwattr $C$DW$715, DW_AT_name("beaconType")
    8305                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("beaconType")
    8306                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8307                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    8308                            .dwattr $C$DW$715, DW_AT_decl_file("..\Application\api_mac.h")
    8309                            .dwattr $C$DW$715, DW_AT_decl_line(0x886)
    8310                            .dwattr $C$DW$715, DW_AT_decl_column(0x19)
    8311                    
    8312                    $C$DW$716       .dwtag  DW_TAG_member
    8313                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$27)
    8314                            .dwattr $C$DW$716, DW_AT_name("bsn")
    8315                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("bsn")
    8316                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8317                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    8318                            .dwattr $C$DW$716, DW_AT_decl_file("..\Application\api_mac.h")
    8319                            .dwattr $C$DW$716, DW_AT_decl_line(0x888)
    8320                            .dwattr $C$DW$716, DW_AT_decl_column(0x0d)
    8321                    
    8322                    $C$DW$717       .dwtag  DW_TAG_member
    8323                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$28)
    8324                            .dwattr $C$DW$717, DW_AT_name("panDesc")
    8325                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("panDesc")
    8326                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8327                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    8328                            .dwattr $C$DW$717, DW_AT_decl_file("..\Application\api_mac.h")
    8329                            .dwattr $C$DW$717, DW_AT_decl_line(0x88a)
    8330                            .dwattr $C$DW$717, DW_AT_decl_column(0x16)
    8331                    
    8332                    $C$DW$718       .dwtag  DW_TAG_member
    8333                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$98)
    8334                            .dwattr $C$DW$718, DW_AT_name("beaconData")
    8335                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("beaconData")
    8336                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8337                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    8338                            .dwattr $C$DW$718, DW_AT_decl_file("..\Application\api_mac.h")
    8339                            .dwattr $C$DW$718, DW_AT_decl_line(0x895)
    8340                            .dwattr $C$DW$718, DW_AT_decl_column(0x07)
    8341                    
    8342                            .dwattr $C$DW$T$29, DW_AT_decl_file("..\Application\api_mac.h")
    8343                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x884)
    8344                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    8345                            .dwendtag $C$DW$T$29
    8346                    
    8347                    $C$DW$T$285     .dwtag  DW_TAG_typedef
    8348                            .dwattr $C$DW$T$285, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    8349                            .dwattr $C$DW$T$285, DW_AT_type(*$C$DW$T$29)
    8350                            .dwattr $C$DW$T$285, DW_AT_language(DW_LANG_C)
    8351                            .dwattr $C$DW$T$285, DW_AT_decl_file("..\Application\api_mac.h")
    8352                            .dwattr $C$DW$T$285, DW_AT_decl_line(0x896)
    8353                            .dwattr $C$DW$T$285, DW_AT_decl_column(0x03)
    8354                    
    8355                    $C$DW$T$286     .dwtag  DW_TAG_pointer_type
    8356                            .dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$285)
    8357                            .dwattr $C$DW$T$286, DW_AT_address_class(0x20)
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  154

    8358                    
    8359                    
    8360                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    8361                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x0e)
    8362                    $C$DW$719       .dwtag  DW_TAG_member
    8363                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$30)
    8364                            .dwattr $C$DW$719, DW_AT_name("devInfo")
    8365                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("devInfo")
    8366                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8367                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8368                            .dwattr $C$DW$719, DW_AT_decl_file("..\Application\llc.h")
    8369                            .dwattr $C$DW$719, DW_AT_decl_line(0x47)
    8370                            .dwattr $C$DW$719, DW_AT_decl_column(0x1f)
    8371                    
    8372                    $C$DW$720       .dwtag  DW_TAG_member
    8373                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$27)
    8374                            .dwattr $C$DW$720, DW_AT_name("channel")
    8375                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("channel")
    8376                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8377                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8378                            .dwattr $C$DW$720, DW_AT_decl_file("..\Application\llc.h")
    8379                            .dwattr $C$DW$720, DW_AT_decl_line(0x49)
    8380                            .dwattr $C$DW$720, DW_AT_decl_column(0x0d)
    8381                    
    8382                    $C$DW$721       .dwtag  DW_TAG_member
    8383                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$31)
    8384                            .dwattr $C$DW$721, DW_AT_name("fh")
    8385                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("fh")
    8386                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8387                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8388                            .dwattr $C$DW$721, DW_AT_decl_file("..\Application\llc.h")
    8389                            .dwattr $C$DW$721, DW_AT_decl_line(0x4b)
    8390                            .dwattr $C$DW$721, DW_AT_decl_column(0x0a)
    8391                    
    8392                            .dwattr $C$DW$T$32, DW_AT_decl_file("..\Application\llc.h")
    8393                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x45)
    8394                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    8395                            .dwendtag $C$DW$T$32
    8396                    
    8397                    $C$DW$T$215     .dwtag  DW_TAG_typedef
    8398                            .dwattr $C$DW$T$215, DW_AT_name("Llc_netInfo_t")
    8399                            .dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$32)
    8400                            .dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
    8401                            .dwattr $C$DW$T$215, DW_AT_decl_file("..\Application\llc.h")
    8402                            .dwattr $C$DW$T$215, DW_AT_decl_line(0x4c)
    8403                            .dwattr $C$DW$T$215, DW_AT_decl_column(0x03)
    8404                    
    8405                    $C$DW$T$216     .dwtag  DW_TAG_pointer_type
    8406                            .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$T$215)
    8407                            .dwattr $C$DW$T$216, DW_AT_address_class(0x20)
    8408                    
    8409                    $C$DW$T$593     .dwtag  DW_TAG_const_type
    8410                            .dwattr $C$DW$T$593, DW_AT_type(*$C$DW$T$216)
    8411                    
    8412                    
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  155

    8413                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    8414                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    8415                    $C$DW$722       .dwtag  DW_TAG_member
    8416                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$34)
    8417                            .dwattr $C$DW$722, DW_AT_name("frameControl")
    8418                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("frameControl")
    8419                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8420                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8421                            .dwattr $C$DW$722, DW_AT_decl_file("..\Application\ssf.h")
    8422                            .dwattr $C$DW$722, DW_AT_decl_line(0x45)
    8423                            .dwattr $C$DW$722, DW_AT_decl_column(0x0e)
    8424                    
    8425                    $C$DW$723       .dwtag  DW_TAG_member
    8426                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$36)
    8427                            .dwattr $C$DW$723, DW_AT_name("reportingInterval")
    8428                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("reportingInterval")
    8429                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8430                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8431                            .dwattr $C$DW$723, DW_AT_decl_file("..\Application\ssf.h")
    8432                            .dwattr $C$DW$723, DW_AT_decl_line(0x47)
    8433                            .dwattr $C$DW$723, DW_AT_decl_column(0x0e)
    8434                    
    8435                    $C$DW$724       .dwtag  DW_TAG_member
    8436                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$36)
    8437                            .dwattr $C$DW$724, DW_AT_name("pollingInterval")
    8438                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("pollingInterval")
    8439                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8440                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8441                            .dwattr $C$DW$724, DW_AT_decl_file("..\Application\ssf.h")
    8442                            .dwattr $C$DW$724, DW_AT_decl_line(0x49)
    8443                            .dwattr $C$DW$724, DW_AT_decl_column(0x0e)
    8444                    
    8445                            .dwattr $C$DW$T$37, DW_AT_decl_file("..\Application\ssf.h")
    8446                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x43)
    8447                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    8448                            .dwendtag $C$DW$T$37
    8449                    
    8450                    $C$DW$T$596     .dwtag  DW_TAG_typedef
    8451                            .dwattr $C$DW$T$596, DW_AT_name("Ssf_configSettings_t")
    8452                            .dwattr $C$DW$T$596, DW_AT_type(*$C$DW$T$37)
    8453                            .dwattr $C$DW$T$596, DW_AT_language(DW_LANG_C)
    8454                            .dwattr $C$DW$T$596, DW_AT_decl_file("..\Application\ssf.h")
    8455                            .dwattr $C$DW$T$596, DW_AT_decl_line(0x4a)
    8456                            .dwattr $C$DW$T$596, DW_AT_decl_column(0x03)
    8457                    
    8458                    $C$DW$T$597     .dwtag  DW_TAG_pointer_type
    8459                            .dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$596)
    8460                            .dwattr $C$DW$T$597, DW_AT_address_class(0x20)
    8461                    
    8462                    
    8463                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    8464                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    8465                    $C$DW$725       .dwtag  DW_TAG_member
    8466                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$14)
    8467                            .dwattr $C$DW$725, DW_AT_name("__max_align1")
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  156

    8468                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("__max_align1")
    8469                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8470                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8471                            .dwattr $C$DW$725, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    8472                            .dwattr $C$DW$725, DW_AT_decl_line(0x70)
    8473                            .dwattr $C$DW$725, DW_AT_decl_column(0x0c)
    8474                    
    8475                    $C$DW$726       .dwtag  DW_TAG_member
    8476                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$18)
    8477                            .dwattr $C$DW$726, DW_AT_name("__max_align2")
    8478                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("__max_align2")
    8479                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8480                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8481                            .dwattr $C$DW$726, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    8482                            .dwattr $C$DW$726, DW_AT_decl_line(0x71)
    8483                            .dwattr $C$DW$726, DW_AT_decl_column(0x0e)
    8484                    
    8485                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    8486                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x6f)
    8487                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    8488                            .dwendtag $C$DW$T$38
    8489                    
    8490                    $C$DW$T$599     .dwtag  DW_TAG_typedef
    8491                            .dwattr $C$DW$T$599, DW_AT_name("__max_align_t")
    8492                            .dwattr $C$DW$T$599, DW_AT_type(*$C$DW$T$38)
    8493                            .dwattr $C$DW$T$599, DW_AT_language(DW_LANG_C)
    8494                            .dwattr $C$DW$T$599, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    8495                            .dwattr $C$DW$T$599, DW_AT_decl_line(0x72)
    8496                            .dwattr $C$DW$T$599, DW_AT_decl_column(0x03)
    8497                    
    8498                    
    8499                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    8500                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    8501                    $C$DW$727       .dwtag  DW_TAG_member
    8502                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$36)
    8503                            .dwattr $C$DW$727, DW_AT_name("frameCounter")
    8504                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("frameCounter")
    8505                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8506                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8507                            .dwattr $C$DW$727, DW_AT_decl_file("..\Application\api_mac.h")
    8508                            .dwattr $C$DW$727, DW_AT_decl_line(0x575)
    8509                            .dwattr $C$DW$727, DW_AT_decl_column(0x1a)
    8510                    
    8511                    $C$DW$728       .dwtag  DW_TAG_member
    8512                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$34)
    8513                            .dwattr $C$DW$728, DW_AT_name("keyIdx")
    8514                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("keyIdx")
    8515                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8516                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8517                            .dwattr $C$DW$728, DW_AT_decl_file("..\Application\api_mac.h")
    8518                            .dwattr $C$DW$728, DW_AT_decl_line(0x576)
    8519                            .dwattr $C$DW$728, DW_AT_decl_column(0x1a)
    8520                    
    8521                            .dwattr $C$DW$T$39, DW_AT_decl_file("..\Application\api_mac.h")
    8522                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x574)
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  157

    8523                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    8524                            .dwendtag $C$DW$T$39
    8525                    
    8526                    $C$DW$T$429     .dwtag  DW_TAG_typedef
    8527                            .dwattr $C$DW$T$429, DW_AT_name("ApiMac_frameCntr_t")
    8528                            .dwattr $C$DW$T$429, DW_AT_type(*$C$DW$T$39)
    8529                            .dwattr $C$DW$T$429, DW_AT_language(DW_LANG_C)
    8530                            .dwattr $C$DW$T$429, DW_AT_decl_file("..\Application\api_mac.h")
    8531                            .dwattr $C$DW$T$429, DW_AT_decl_line(0x577)
    8532                            .dwattr $C$DW$T$429, DW_AT_decl_column(0x03)
    8533                    
    8534                    $C$DW$T$430     .dwtag  DW_TAG_pointer_type
    8535                            .dwattr $C$DW$T$430, DW_AT_type(*$C$DW$T$429)
    8536                            .dwattr $C$DW$T$430, DW_AT_address_class(0x20)
    8537                    
    8538                    
    8539                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    8540                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x14)
    8541                    $C$DW$729       .dwtag  DW_TAG_member
    8542                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$41)
    8543                            .dwattr $C$DW$729, DW_AT_name("fhNumPASolicitSent")
    8544                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("fhNumPASolicitSent")
    8545                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8546                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8547                            .dwattr $C$DW$729, DW_AT_decl_file("..\Application\jdllc.h")
    8548                            .dwattr $C$DW$729, DW_AT_decl_line(0x8b)
    8549                            .dwattr $C$DW$729, DW_AT_decl_column(0x0d)
    8550                    
    8551                    $C$DW$730       .dwtag  DW_TAG_member
    8552                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$41)
    8553                            .dwattr $C$DW$730, DW_AT_name("fhNumPAReceived")
    8554                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("fhNumPAReceived")
    8555                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8556                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8557                            .dwattr $C$DW$730, DW_AT_decl_file("..\Application\jdllc.h")
    8558                            .dwattr $C$DW$730, DW_AT_decl_line(0x8d)
    8559                            .dwattr $C$DW$730, DW_AT_decl_column(0x0d)
    8560                    
    8561                    $C$DW$731       .dwtag  DW_TAG_member
    8562                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$41)
    8563                            .dwattr $C$DW$731, DW_AT_name("fhNumPANConfigSolicitsSent")
    8564                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("fhNumPANConfigSolicitsSent")
    8565                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8566                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8567                            .dwattr $C$DW$731, DW_AT_decl_file("..\Application\jdllc.h")
    8568                            .dwattr $C$DW$731, DW_AT_decl_line(0x8f)
    8569                            .dwattr $C$DW$731, DW_AT_decl_column(0x0d)
    8570                    
    8571                    $C$DW$732       .dwtag  DW_TAG_member
    8572                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$41)
    8573                            .dwattr $C$DW$732, DW_AT_name("fhNumPANConfigReceived")
    8574                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("fhNumPANConfigReceived")
    8575                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8576                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8577                            .dwattr $C$DW$732, DW_AT_decl_file("..\Application\jdllc.h")
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  158

    8578                            .dwattr $C$DW$732, DW_AT_decl_line(0x91)
    8579                            .dwattr $C$DW$732, DW_AT_decl_column(0x0d)
    8580                    
    8581                    $C$DW$733       .dwtag  DW_TAG_member
    8582                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$41)
    8583                            .dwattr $C$DW$733, DW_AT_name("otherStats")
    8584                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("otherStats")
    8585                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8586                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8587                            .dwattr $C$DW$733, DW_AT_decl_file("..\Application\jdllc.h")
    8588                            .dwattr $C$DW$733, DW_AT_decl_line(0x93)
    8589                            .dwattr $C$DW$733, DW_AT_decl_column(0x0d)
    8590                    
    8591                            .dwattr $C$DW$T$42, DW_AT_decl_file("..\Application\jdllc.h")
    8592                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x89)
    8593                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    8594                            .dwendtag $C$DW$T$42
    8595                    
    8596                    $C$DW$T$600     .dwtag  DW_TAG_typedef
    8597                            .dwattr $C$DW$T$600, DW_AT_name("Jdllc_statistics_t")
    8598                            .dwattr $C$DW$T$600, DW_AT_type(*$C$DW$T$42)
    8599                            .dwattr $C$DW$T$600, DW_AT_language(DW_LANG_C)
    8600                            .dwattr $C$DW$T$600, DW_AT_decl_file("..\Application\jdllc.h")
    8601                            .dwattr $C$DW$T$600, DW_AT_decl_line(0x94)
    8602                            .dwattr $C$DW$T$600, DW_AT_decl_column(0x03)
    8603                    
    8604                    
    8605                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    8606                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x08)
    8607                    $C$DW$734       .dwtag  DW_TAG_member
    8608                            .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$10)
    8609                            .dwattr $C$DW$734, DW_AT_name("quot")
    8610                            .dwattr $C$DW$734, DW_AT_TI_symbol_name("quot")
    8611                            .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8612                            .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8613                            .dwattr $C$DW$734, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    8614                            .dwattr $C$DW$734, DW_AT_decl_line(0x49)
    8615                            .dwattr $C$DW$734, DW_AT_decl_column(0x16)
    8616                    
    8617                    $C$DW$735       .dwtag  DW_TAG_member
    8618                            .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$10)
    8619                            .dwattr $C$DW$735, DW_AT_name("rem")
    8620                            .dwattr $C$DW$735, DW_AT_TI_symbol_name("rem")
    8621                            .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8622                            .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8623                            .dwattr $C$DW$735, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    8624                            .dwattr $C$DW$735, DW_AT_decl_line(0x49)
    8625                            .dwattr $C$DW$735, DW_AT_decl_column(0x1c)
    8626                    
    8627                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    8628                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x49)
    8629                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    8630                            .dwendtag $C$DW$T$43
    8631                    
    8632                    $C$DW$T$601     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  159

    8633                            .dwattr $C$DW$T$601, DW_AT_name("div_t")
    8634                            .dwattr $C$DW$T$601, DW_AT_type(*$C$DW$T$43)
    8635                            .dwattr $C$DW$T$601, DW_AT_language(DW_LANG_C)
    8636                            .dwattr $C$DW$T$601, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    8637                            .dwattr $C$DW$T$601, DW_AT_decl_line(0x49)
    8638                            .dwattr $C$DW$T$601, DW_AT_decl_column(0x23)
    8639                    
    8640                    
    8641                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    8642                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x08)
    8643                    $C$DW$736       .dwtag  DW_TAG_member
    8644                            .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$10)
    8645                            .dwattr $C$DW$736, DW_AT_name("quot")
    8646                            .dwattr $C$DW$736, DW_AT_TI_symbol_name("quot")
    8647                            .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8648                            .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8649                            .dwattr $C$DW$736, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    8650                            .dwattr $C$DW$736, DW_AT_decl_line(0x4e)
    8651                            .dwattr $C$DW$736, DW_AT_decl_column(0x16)
    8652                    
    8653                    $C$DW$737       .dwtag  DW_TAG_member
    8654                            .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$10)
    8655                            .dwattr $C$DW$737, DW_AT_name("rem")
    8656                            .dwattr $C$DW$737, DW_AT_TI_symbol_name("rem")
    8657                            .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8658                            .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8659                            .dwattr $C$DW$737, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    8660                            .dwattr $C$DW$737, DW_AT_decl_line(0x4e)
    8661                            .dwattr $C$DW$737, DW_AT_decl_column(0x1c)
    8662                    
    8663                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    8664                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x4e)
    8665                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    8666                            .dwendtag $C$DW$T$44
    8667                    
    8668                    $C$DW$T$602     .dwtag  DW_TAG_typedef
    8669                            .dwattr $C$DW$T$602, DW_AT_name("ldiv_t")
    8670                            .dwattr $C$DW$T$602, DW_AT_type(*$C$DW$T$44)
    8671                            .dwattr $C$DW$T$602, DW_AT_language(DW_LANG_C)
    8672                            .dwattr $C$DW$T$602, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    8673                            .dwattr $C$DW$T$602, DW_AT_decl_line(0x4e)
    8674                            .dwattr $C$DW$T$602, DW_AT_decl_column(0x23)
    8675                    
    8676                    
    8677                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    8678                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x10)
    8679                    $C$DW$738       .dwtag  DW_TAG_member
    8680                            .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$14)
    8681                            .dwattr $C$DW$738, DW_AT_name("quot")
    8682                            .dwattr $C$DW$738, DW_AT_TI_symbol_name("quot")
    8683                            .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8684                            .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8685                            .dwattr $C$DW$738, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    8686                            .dwattr $C$DW$738, DW_AT_decl_line(0x56)
    8687                            .dwattr $C$DW$738, DW_AT_decl_column(0x1c)
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  160

    8688                    
    8689                    $C$DW$739       .dwtag  DW_TAG_member
    8690                            .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$14)
    8691                            .dwattr $C$DW$739, DW_AT_name("rem")
    8692                            .dwattr $C$DW$739, DW_AT_TI_symbol_name("rem")
    8693                            .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8694                            .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8695                            .dwattr $C$DW$739, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/s
    8696                            .dwattr $C$DW$739, DW_AT_decl_line(0x56)
    8697                            .dwattr $C$DW$739, DW_AT_decl_column(0x22)
    8698                    
    8699                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include/
    8700                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x56)
    8701                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    8702                            .dwendtag $C$DW$T$45
    8703                    
    8704                    $C$DW$T$603     .dwtag  DW_TAG_typedef
    8705                            .dwattr $C$DW$T$603, DW_AT_name("lldiv_t")
    8706                            .dwattr $C$DW$T$603, DW_AT_type(*$C$DW$T$45)
    8707                            .dwattr $C$DW$T$603, DW_AT_language(DW_LANG_C)
    8708                            .dwattr $C$DW$T$603, DW_AT_decl_file("C:/ti/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.LTS/include
    8709                            .dwattr $C$DW$T$603, DW_AT_decl_line(0x56)
    8710                            .dwattr $C$DW$T$603, DW_AT_decl_column(0x29)
    8711                    
    8712                    
    8713                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    8714                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    8715                    $C$DW$740       .dwtag  DW_TAG_member
    8716                            .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$48)
    8717                            .dwattr $C$DW$740, DW_AT_name("pointerStack")
    8718                            .dwattr $C$DW$740, DW_AT_TI_symbol_name("pointerStack")
    8719                            .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8720                            .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8721                            .dwattr $C$DW$740, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8722                            .dwattr $C$DW$740, DW_AT_decl_line(0x3f5)
    8723                            .dwattr $C$DW$740, DW_AT_decl_column(0x16)
    8724                    
    8725                    $C$DW$741       .dwtag  DW_TAG_member
    8726                            .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$49)
    8727                            .dwattr $C$DW$741, DW_AT_name("directAPI")
    8728                            .dwattr $C$DW$741, DW_AT_TI_symbol_name("directAPI")
    8729                            .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8730                            .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8731                            .dwattr $C$DW$741, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8732                            .dwattr $C$DW$741, DW_AT_decl_line(0x3f6)
    8733                            .dwattr $C$DW$741, DW_AT_decl_column(0x15)
    8734                    
    8735                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    8736                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x3f4)
    8737                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    8738                            .dwendtag $C$DW$T$50
    8739                    
    8740                    $C$DW$T$52      .dwtag  DW_TAG_typedef
    8741                            .dwattr $C$DW$T$52, DW_AT_name("icall_directAPIMsg_t")
    8742                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$50)
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  161

    8743                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    8744                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    8745                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x3f7)
    8746                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
    8747                    
    8748                    
    8749                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    8750                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
    8751                    $C$DW$742       .dwtag  DW_TAG_member
    8752                            .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$51)
    8753                            .dwattr $C$DW$742, DW_AT_name("hdr")
    8754                            .dwattr $C$DW$742, DW_AT_TI_symbol_name("hdr")
    8755                            .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8756                            .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8757                            .dwattr $C$DW$742, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8758                            .dwattr $C$DW$742, DW_AT_decl_line(0x3fb)
    8759                            .dwattr $C$DW$742, DW_AT_decl_column(0x10)
    8760                    
    8761                    $C$DW$743       .dwtag  DW_TAG_member
    8762                            .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$52)
    8763                            .dwattr $C$DW$743, DW_AT_name("msg")
    8764                            .dwattr $C$DW$743, DW_AT_TI_symbol_name("msg")
    8765                            .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8766                            .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8767                            .dwattr $C$DW$743, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8768                            .dwattr $C$DW$743, DW_AT_decl_line(0x3fc)
    8769                            .dwattr $C$DW$743, DW_AT_decl_column(0x1a)
    8770                    
    8771                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    8772                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x3fa)
    8773                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    8774                            .dwendtag $C$DW$T$53
    8775                    
    8776                    $C$DW$T$604     .dwtag  DW_TAG_typedef
    8777                            .dwattr $C$DW$T$604, DW_AT_name("icallLiteMsg_t")
    8778                            .dwattr $C$DW$T$604, DW_AT_type(*$C$DW$T$53)
    8779                            .dwattr $C$DW$T$604, DW_AT_language(DW_LANG_C)
    8780                            .dwattr $C$DW$T$604, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8781                            .dwattr $C$DW$T$604, DW_AT_decl_line(0x3fd)
    8782                            .dwattr $C$DW$T$604, DW_AT_decl_column(0x03)
    8783                    
    8784                    
    8785                    $C$DW$T$92      .dwtag  DW_TAG_structure_type
    8786                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x4c)
    8787                    $C$DW$744       .dwtag  DW_TAG_member
    8788                            .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$57)
    8789                            .dwattr $C$DW$744, DW_AT_name("Crc32")
    8790                            .dwattr $C$DW$744, DW_AT_TI_symbol_name("Crc32")
    8791                            .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8792                            .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8793                            .dwattr $C$DW$744, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8794                            .dwattr $C$DW$744, DW_AT_decl_line(0x76)
    8795                            .dwattr $C$DW$744, DW_AT_decl_column(0x25)
    8796                    
    8797                    $C$DW$745       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  162

    8798                            .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$60)
    8799                            .dwattr $C$DW$745, DW_AT_name("FlashGetSize")
    8800                            .dwattr $C$DW$745, DW_AT_TI_symbol_name("FlashGetSize")
    8801                            .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8802                            .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8803                            .dwattr $C$DW$745, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8804                            .dwattr $C$DW$745, DW_AT_decl_line(0x77)
    8805                            .dwattr $C$DW$745, DW_AT_decl_column(0x25)
    8806                    
    8807                    $C$DW$746       .dwtag  DW_TAG_member
    8808                            .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$61)
    8809                            .dwattr $C$DW$746, DW_AT_name("GetChipId")
    8810                            .dwattr $C$DW$746, DW_AT_TI_symbol_name("GetChipId")
    8811                            .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8812                            .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8813                            .dwattr $C$DW$746, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8814                            .dwattr $C$DW$746, DW_AT_decl_line(0x78)
    8815                            .dwattr $C$DW$746, DW_AT_decl_column(0x25)
    8816                    
    8817                    $C$DW$747       .dwtag  DW_TAG_member
    8818                            .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$64)
    8819                            .dwattr $C$DW$747, DW_AT_name("ReservedLocation1")
    8820                            .dwattr $C$DW$747, DW_AT_TI_symbol_name("ReservedLocation1")
    8821                            .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8822                            .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8823                            .dwattr $C$DW$747, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8824                            .dwattr $C$DW$747, DW_AT_decl_line(0x79)
    8825                            .dwattr $C$DW$747, DW_AT_decl_column(0x25)
    8826                    
    8827                    $C$DW$748       .dwtag  DW_TAG_member
    8828                            .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$65)
    8829                            .dwattr $C$DW$748, DW_AT_name("ReservedLocation2")
    8830                            .dwattr $C$DW$748, DW_AT_TI_symbol_name("ReservedLocation2")
    8831                            .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8832                            .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8833                            .dwattr $C$DW$748, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8834                            .dwattr $C$DW$748, DW_AT_decl_line(0x7a)
    8835                            .dwattr $C$DW$748, DW_AT_decl_column(0x25)
    8836                    
    8837                    $C$DW$749       .dwtag  DW_TAG_member
    8838                            .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$66)
    8839                            .dwattr $C$DW$749, DW_AT_name("ReservedLocation3")
    8840                            .dwattr $C$DW$749, DW_AT_TI_symbol_name("ReservedLocation3")
    8841                            .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8842                            .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8843                            .dwattr $C$DW$749, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8844                            .dwattr $C$DW$749, DW_AT_decl_line(0x7b)
    8845                            .dwattr $C$DW$749, DW_AT_decl_column(0x25)
    8846                    
    8847                    $C$DW$750       .dwtag  DW_TAG_member
    8848                            .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$69)
    8849                            .dwattr $C$DW$750, DW_AT_name("ResetDevice")
    8850                            .dwattr $C$DW$750, DW_AT_TI_symbol_name("ResetDevice")
    8851                            .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8852                            .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  163

    8853                            .dwattr $C$DW$750, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8854                            .dwattr $C$DW$750, DW_AT_decl_line(0x7c)
    8855                            .dwattr $C$DW$750, DW_AT_decl_column(0x25)
    8856                    
    8857                    $C$DW$751       .dwtag  DW_TAG_member
    8858                            .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$73)
    8859                            .dwattr $C$DW$751, DW_AT_name("Fletcher32")
    8860                            .dwattr $C$DW$751, DW_AT_TI_symbol_name("Fletcher32")
    8861                            .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8862                            .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8863                            .dwattr $C$DW$751, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8864                            .dwattr $C$DW$751, DW_AT_decl_line(0x7d)
    8865                            .dwattr $C$DW$751, DW_AT_decl_column(0x25)
    8866                    
    8867                    $C$DW$752       .dwtag  DW_TAG_member
    8868                            .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$77)
    8869                            .dwattr $C$DW$752, DW_AT_name("MinValue")
    8870                            .dwattr $C$DW$752, DW_AT_TI_symbol_name("MinValue")
    8871                            .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8872                            .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8873                            .dwattr $C$DW$752, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8874                            .dwattr $C$DW$752, DW_AT_decl_line(0x7e)
    8875                            .dwattr $C$DW$752, DW_AT_decl_column(0x25)
    8876                    
    8877                    $C$DW$753       .dwtag  DW_TAG_member
    8878                            .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$78)
    8879                            .dwattr $C$DW$753, DW_AT_name("MaxValue")
    8880                            .dwattr $C$DW$753, DW_AT_TI_symbol_name("MaxValue")
    8881                            .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8882                            .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8883                            .dwattr $C$DW$753, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8884                            .dwattr $C$DW$753, DW_AT_decl_line(0x7f)
    8885                            .dwattr $C$DW$753, DW_AT_decl_column(0x25)
    8886                    
    8887                    $C$DW$754       .dwtag  DW_TAG_member
    8888                            .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$79)
    8889                            .dwattr $C$DW$754, DW_AT_name("MeanValue")
    8890                            .dwattr $C$DW$754, DW_AT_TI_symbol_name("MeanValue")
    8891                            .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8892                            .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8893                            .dwattr $C$DW$754, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8894                            .dwattr $C$DW$754, DW_AT_decl_line(0x80)
    8895                            .dwattr $C$DW$754, DW_AT_decl_column(0x25)
    8896                    
    8897                    $C$DW$755       .dwtag  DW_TAG_member
    8898                            .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$80)
    8899                            .dwattr $C$DW$755, DW_AT_name("StandDeviationValue")
    8900                            .dwattr $C$DW$755, DW_AT_TI_symbol_name("StandDeviationValue")
    8901                            .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8902                            .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8903                            .dwattr $C$DW$755, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8904                            .dwattr $C$DW$755, DW_AT_decl_line(0x81)
    8905                            .dwattr $C$DW$755, DW_AT_decl_column(0x25)
    8906                    
    8907                    $C$DW$756       .dwtag  DW_TAG_member
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  164

    8908                            .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$83)
    8909                            .dwattr $C$DW$756, DW_AT_name("ReservedLocation4")
    8910                            .dwattr $C$DW$756, DW_AT_TI_symbol_name("ReservedLocation4")
    8911                            .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8912                            .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8913                            .dwattr $C$DW$756, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8914                            .dwattr $C$DW$756, DW_AT_decl_line(0x82)
    8915                            .dwattr $C$DW$756, DW_AT_decl_column(0x25)
    8916                    
    8917                    $C$DW$757       .dwtag  DW_TAG_member
    8918                            .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$84)
    8919                            .dwattr $C$DW$757, DW_AT_name("ReservedLocation5")
    8920                            .dwattr $C$DW$757, DW_AT_TI_symbol_name("ReservedLocation5")
    8921                            .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8922                            .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8923                            .dwattr $C$DW$757, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8924                            .dwattr $C$DW$757, DW_AT_decl_line(0x83)
    8925                            .dwattr $C$DW$757, DW_AT_decl_column(0x25)
    8926                    
    8927                    $C$DW$758       .dwtag  DW_TAG_member
    8928                            .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$85)
    8929                            .dwattr $C$DW$758, DW_AT_name("HFSourceSafeSwitch")
    8930                            .dwattr $C$DW$758, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    8931                            .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8932                            .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8933                            .dwattr $C$DW$758, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8934                            .dwattr $C$DW$758, DW_AT_decl_line(0x84)
    8935                            .dwattr $C$DW$758, DW_AT_decl_column(0x25)
    8936                    
    8937                    $C$DW$759       .dwtag  DW_TAG_member
    8938                            .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$88)
    8939                            .dwattr $C$DW$759, DW_AT_name("SelectCompAInput")
    8940                            .dwattr $C$DW$759, DW_AT_TI_symbol_name("SelectCompAInput")
    8941                            .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8942                            .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8943                            .dwattr $C$DW$759, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8944                            .dwattr $C$DW$759, DW_AT_decl_line(0x85)
    8945                            .dwattr $C$DW$759, DW_AT_decl_column(0x25)
    8946                    
    8947                    $C$DW$760       .dwtag  DW_TAG_member
    8948                            .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$89)
    8949                            .dwattr $C$DW$760, DW_AT_name("SelectCompARef")
    8950                            .dwattr $C$DW$760, DW_AT_TI_symbol_name("SelectCompARef")
    8951                            .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8952                            .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8953                            .dwattr $C$DW$760, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8954                            .dwattr $C$DW$760, DW_AT_decl_line(0x86)
    8955                            .dwattr $C$DW$760, DW_AT_decl_column(0x25)
    8956                    
    8957                    $C$DW$761       .dwtag  DW_TAG_member
    8958                            .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$90)
    8959                            .dwattr $C$DW$761, DW_AT_name("SelectADCCompBInput")
    8960                            .dwattr $C$DW$761, DW_AT_TI_symbol_name("SelectADCCompBInput")
    8961                            .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8962                            .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  165

    8963                            .dwattr $C$DW$761, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8964                            .dwattr $C$DW$761, DW_AT_decl_line(0x87)
    8965                            .dwattr $C$DW$761, DW_AT_decl_column(0x25)
    8966                    
    8967                    $C$DW$762       .dwtag  DW_TAG_member
    8968                            .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$91)
    8969                            .dwattr $C$DW$762, DW_AT_name("SelectCompBRef")
    8970                            .dwattr $C$DW$762, DW_AT_TI_symbol_name("SelectCompBRef")
    8971                            .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8972                            .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8973                            .dwattr $C$DW$762, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    8974                            .dwattr $C$DW$762, DW_AT_decl_line(0x88)
    8975                            .dwattr $C$DW$762, DW_AT_decl_column(0x25)
    8976                    
    8977                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    8978                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x75)
    8979                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x01)
    8980                            .dwendtag $C$DW$T$92
    8981                    
    8982                    $C$DW$T$605     .dwtag  DW_TAG_typedef
    8983                            .dwattr $C$DW$T$605, DW_AT_name("HARD_API_T")
    8984                            .dwattr $C$DW$T$605, DW_AT_type(*$C$DW$T$92)
    8985                            .dwattr $C$DW$T$605, DW_AT_language(DW_LANG_C)
    8986                            .dwattr $C$DW$T$605, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    8987                            .dwattr $C$DW$T$605, DW_AT_decl_line(0x89)
    8988                            .dwattr $C$DW$T$605, DW_AT_decl_column(0x03)
    8989                    
    8990                    
    8991                    $C$DW$T$95      .dwtag  DW_TAG_union_type
    8992                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x08)
    8993                    $C$DW$763       .dwtag  DW_TAG_member
    8994                            .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$34)
    8995                            .dwattr $C$DW$763, DW_AT_name("shortAddr")
    8996                            .dwattr $C$DW$763, DW_AT_TI_symbol_name("shortAddr")
    8997                            .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8998                            .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8999                            .dwattr $C$DW$763, DW_AT_decl_file("..\Application\api_mac.h")
    9000                            .dwattr $C$DW$763, DW_AT_decl_line(0x4d8)
    9001                            .dwattr $C$DW$763, DW_AT_decl_column(0x12)
    9002                    
    9003                    $C$DW$764       .dwtag  DW_TAG_member
    9004                            .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$94)
    9005                            .dwattr $C$DW$764, DW_AT_name("extAddr")
    9006                            .dwattr $C$DW$764, DW_AT_TI_symbol_name("extAddr")
    9007                            .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9008                            .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    9009                            .dwattr $C$DW$764, DW_AT_decl_file("..\Application\api_mac.h")
    9010                            .dwattr $C$DW$764, DW_AT_decl_line(0x4da)
    9011                            .dwattr $C$DW$764, DW_AT_decl_column(0x1b)
    9012                    
    9013                            .dwattr $C$DW$T$95, DW_AT_decl_file("..\Application\api_mac.h")
    9014                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x4d6)
    9015                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x05)
    9016                            .dwendtag $C$DW$T$95
    9017                    
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  166

    9018                    
    9019                    $C$DW$T$98      .dwtag  DW_TAG_union_type
    9020                            .dwattr $C$DW$T$98, DW_AT_byte_size(0x18)
    9021                    $C$DW$765       .dwtag  DW_TAG_member
    9022                            .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$96)
    9023                            .dwattr $C$DW$765, DW_AT_name("beacon")
    9024                            .dwattr $C$DW$765, DW_AT_TI_symbol_name("beacon")
    9025                            .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9026                            .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    9027                            .dwattr $C$DW$765, DW_AT_decl_file("..\Application\api_mac.h")
    9028                            .dwattr $C$DW$765, DW_AT_decl_line(0x892)
    9029                            .dwattr $C$DW$765, DW_AT_decl_column(0x1d)
    9030                    
    9031                    $C$DW$766       .dwtag  DW_TAG_member
    9032                            .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$97)
    9033                            .dwattr $C$DW$766, DW_AT_name("eBeacon")
    9034                            .dwattr $C$DW$766, DW_AT_TI_symbol_name("eBeacon")
    9035                            .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9036                            .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    9037                            .dwattr $C$DW$766, DW_AT_decl_file("..\Application\api_mac.h")
    9038                            .dwattr $C$DW$766, DW_AT_decl_line(0x894)
    9039                            .dwattr $C$DW$766, DW_AT_decl_column(0x1e)
    9040                    
    9041                            .dwattr $C$DW$T$98, DW_AT_decl_file("..\Application\api_mac.h")
    9042                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x890)
    9043                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x05)
    9044                            .dwendtag $C$DW$T$98
    9045                    
    9046                    
    9047                    $C$DW$T$100     .dwtag  DW_TAG_union_type
    9048                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    9049                    $C$DW$767       .dwtag  DW_TAG_member
    9050                            .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$54)
    9051                            .dwattr $C$DW$767, DW_AT_name("pEnergyDetect")
    9052                            .dwattr $C$DW$767, DW_AT_TI_symbol_name("pEnergyDetect")
    9053                            .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9054                            .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    9055                            .dwattr $C$DW$767, DW_AT_decl_file("..\Application\api_mac.h")
    9056                            .dwattr $C$DW$767, DW_AT_decl_line(0x8b4)
    9057                            .dwattr $C$DW$767, DW_AT_decl_column(0x12)
    9058                    
    9059                    $C$DW$768       .dwtag  DW_TAG_member
    9060                            .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$99)
    9061                            .dwattr $C$DW$768, DW_AT_name("pPanDescriptor")
    9062                            .dwattr $C$DW$768, DW_AT_TI_symbol_name("pPanDescriptor")
    9063                            .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9064                            .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    9065                            .dwattr $C$DW$768, DW_AT_decl_file("..\Application\api_mac.h")
    9066                            .dwattr $C$DW$768, DW_AT_decl_line(0x8b6)
    9067                            .dwattr $C$DW$768, DW_AT_decl_column(0x1b)
    9068                    
    9069                            .dwattr $C$DW$T$100, DW_AT_decl_file("..\Application\api_mac.h")
    9070                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x8b2)
    9071                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x05)
    9072                            .dwendtag $C$DW$T$100
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  167

    9073                    
    9074                    
    9075                    $C$DW$T$107     .dwtag  DW_TAG_union_type
    9076                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x02)
    9077                    $C$DW$769       .dwtag  DW_TAG_member
    9078                            .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$103)
    9079                            .dwattr $C$DW$769, DW_AT_name("entityId")
    9080                            .dwattr $C$DW$769, DW_AT_TI_symbol_name("entityId")
    9081                            .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9082                            .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    9083                            .dwattr $C$DW$769, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    9084                            .dwattr $C$DW$769, DW_AT_decl_line(0x1fe)
    9085                            .dwattr $C$DW$769, DW_AT_decl_column(0x14)
    9086                    
    9087                    $C$DW$770       .dwtag  DW_TAG_member
    9088                            .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$106)
    9089                            .dwattr $C$DW$770, DW_AT_name("servId")
    9090                            .dwattr $C$DW$770, DW_AT_TI_symbol_name("servId")
    9091                            .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9092                            .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    9093                            .dwattr $C$DW$770, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    9094                            .dwattr $C$DW$770, DW_AT_decl_line(0x200)
    9095                            .dwattr $C$DW$770, DW_AT_decl_column(0x17)
    9096                    
    9097                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    9098                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x1fc)
    9099                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x03)
    9100                            .dwendtag $C$DW$T$107
    9101                    
    9102                    
    9103                    $C$DW$T$108     .dwtag  DW_TAG_union_type
    9104                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x02)
    9105                    $C$DW$771       .dwtag  DW_TAG_member
    9106                            .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$106)
    9107                            .dwattr $C$DW$771, DW_AT_name("servId")
    9108                            .dwattr $C$DW$771, DW_AT_TI_symbol_name("servId")
    9109                            .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9110                            .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    9111                            .dwattr $C$DW$771, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    9112                            .dwattr $C$DW$771, DW_AT_decl_line(0x211)
    9113                            .dwattr $C$DW$771, DW_AT_decl_column(0x17)
    9114                    
    9115                    $C$DW$772       .dwtag  DW_TAG_member
    9116                            .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$103)
    9117                            .dwattr $C$DW$772, DW_AT_name("entityId")
    9118                            .dwattr $C$DW$772, DW_AT_TI_symbol_name("entityId")
    9119                            .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9120                            .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    9121                            .dwattr $C$DW$772, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    9122                            .dwattr $C$DW$772, DW_AT_decl_line(0x213)
    9123                            .dwattr $C$DW$772, DW_AT_decl_column(0x14)
    9124                    
    9125                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    9126                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x20f)
    9127                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x03)
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  168

    9128                            .dwendtag $C$DW$T$108
    9129                    
    9130                    
    9131                    $C$DW$T$110     .dwtag  DW_TAG_structure_type
    9132                            .dwattr $C$DW$T$110, DW_AT_name(".ggroup1")
    9133                            .dwattr $C$DW$T$110, DW_AT_byte_size(0xd0)
    9134                    $C$DW$773       .dwtag  DW_TAG_member
    9135                            .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$6)
    9136                            .dwattr $C$DW$773, DW_AT_name("rejoining")
    9137                            .dwattr $C$DW$773, DW_AT_TI_symbol_name("rejoining")
    9138                            .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9139                            .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    9140                    
    9141                    $C$DW$774       .dwtag  DW_TAG_member
    9142                            .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$6)
    9143                            .dwattr $C$DW$774, DW_AT_name("deviceTxMsduHandle")
    9144                            .dwattr $C$DW$774, DW_AT_TI_symbol_name("deviceTxMsduHandle")
    9145                            .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9146                            .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    9147                    
    9148                    $C$DW$775       .dwtag  DW_TAG_member
    9149                            .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$9)
    9150                            .dwattr $C$DW$775, DW_AT_name("Sensor_events")
    9151                            .dwattr $C$DW$775, DW_AT_TI_symbol_name("Sensor_events")
    9152                            .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9153                            .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    9154                    
    9155                    $C$DW$776       .dwtag  DW_TAG_member
    9156                            .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$248)
    9157                            .dwattr $C$DW$776, DW_AT_name("lightSensor")
    9158                            .dwattr $C$DW$776, DW_AT_TI_symbol_name("lightSensor")
    9159                            .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9160                            .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    9161                    
    9162                    $C$DW$777       .dwtag  DW_TAG_member
    9163                            .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$9)
    9164                            .dwattr $C$DW$777, DW_AT_name("lastRcvdBroadcastMsgId")
    9165                            .dwattr $C$DW$777, DW_AT_TI_symbol_name("lastRcvdBroadcastMsgId")
    9166                            .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9167                            .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    9168                    
    9169                    $C$DW$778       .dwtag  DW_TAG_member
    9170                            .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$109)
    9171                            .dwattr $C$DW$778, DW_AT_name("display")
    9172                            .dwattr $C$DW$778, DW_AT_TI_symbol_name("display")
    9173                            .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9174                            .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    9175                    
    9176                    $C$DW$779       .dwtag  DW_TAG_member
    9177                            .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$3)
    9178                            .dwattr $C$DW$779, DW_AT_name("sem")
    9179                            .dwattr $C$DW$779, DW_AT_TI_symbol_name("sem")
    9180                            .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9181                            .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    9182                    
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  169

    9183                    $C$DW$780       .dwtag  DW_TAG_member
    9184                            .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$11)
    9185                            .dwattr $C$DW$780, DW_AT_name("joinTimeTicks")
    9186                            .dwattr $C$DW$780, DW_AT_TI_symbol_name("joinTimeTicks")
    9187                            .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9188                            .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    9189                    
    9190                    $C$DW$781       .dwtag  DW_TAG_member
    9191                            .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$11)
    9192                            .dwattr $C$DW$781, DW_AT_name("startSensorMsgTimeStamp")
    9193                            .dwattr $C$DW$781, DW_AT_TI_symbol_name("startSensorMsgTimeStamp")
    9194                            .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9195                            .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    9196                    
    9197                    $C$DW$782       .dwtag  DW_TAG_member
    9198                            .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$258)
    9199                            .dwattr $C$DW$782, DW_AT_name("tempSensor")
    9200                            .dwattr $C$DW$782, DW_AT_TI_symbol_name("tempSensor")
    9201                            .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9202                            .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    9203                    
    9204                    $C$DW$783       .dwtag  DW_TAG_member
    9205                            .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$245)
    9206                            .dwattr $C$DW$783, DW_AT_name("humiditySensor")
    9207                            .dwattr $C$DW$783, DW_AT_TI_symbol_name("humiditySensor")
    9208                            .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9209                            .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    9210                    
    9211                    $C$DW$784       .dwtag  DW_TAG_member
    9212                            .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$23)
    9213                            .dwattr $C$DW$784, DW_AT_name("collectorAddr")
    9214                            .dwattr $C$DW$784, DW_AT_TI_symbol_name("collectorAddr")
    9215                            .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9216                            .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    9217                    
    9218                    $C$DW$785       .dwtag  DW_TAG_member
    9219                            .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$240)
    9220                            .dwattr $C$DW$785, DW_AT_name("configSettings")
    9221                            .dwattr $C$DW$785, DW_AT_TI_symbol_name("configSettings")
    9222                            .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9223                            .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    9224                    
    9225                    $C$DW$786       .dwtag  DW_TAG_member
    9226                            .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$32)
    9227                            .dwattr $C$DW$786, DW_AT_name("parentInfo")
    9228                            .dwattr $C$DW$786, DW_AT_TI_symbol_name("parentInfo")
    9229                            .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9230                            .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    9231                    
    9232                    $C$DW$787       .dwtag  DW_TAG_member
    9233                            .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$236)
    9234                            .dwattr $C$DW$787, DW_AT_name("jdllcCallbacks")
    9235                            .dwattr $C$DW$787, DW_AT_TI_symbol_name("jdllcCallbacks")
    9236                            .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9237                            .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  170

    9238                    
    9239                    $C$DW$788       .dwtag  DW_TAG_member
    9240                            .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$249)
    9241                            .dwattr $C$DW$788, DW_AT_name("Sensor_msgStats")
    9242                            .dwattr $C$DW$788, DW_AT_TI_symbol_name("Sensor_msgStats")
    9243                            .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    9244                            .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    9245                    
    9246                    $C$DW$789       .dwtag  DW_TAG_member
    9247                            .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$353)
    9248                            .dwattr $C$DW$789, DW_AT_name("Sensor_macCallbacks")
    9249                            .dwattr $C$DW$789, DW_AT_TI_symbol_name("Sensor_macCallbacks")
    9250                            .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    9251                            .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    9252                    
    9253                            .dwendtag $C$DW$T$110
    9254                    
    9255                    
    9256                    $C$DW$T$608     .dwtag  DW_TAG_enumeration_type
    9257                            .dwattr $C$DW$T$608, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    9258                            .dwattr $C$DW$T$608, DW_AT_byte_size(0x01)
    9259                    $C$DW$790       .dwtag  DW_TAG_enumerator
    9260                            .dwattr $C$DW$790, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL0")
    9261                            .dwattr $C$DW$790, DW_AT_const_value(0x00)
    9262                            .dwattr $C$DW$790, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9263                            .dwattr $C$DW$790, DW_AT_decl_line(0xba)
    9264                            .dwattr $C$DW$790, DW_AT_decl_column(0x05)
    9265                    
    9266                    $C$DW$791       .dwtag  DW_TAG_enumerator
    9267                            .dwattr $C$DW$791, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL1")
    9268                            .dwattr $C$DW$791, DW_AT_const_value(0x01)
    9269                            .dwattr $C$DW$791, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9270                            .dwattr $C$DW$791, DW_AT_decl_line(0xbb)
    9271                            .dwattr $C$DW$791, DW_AT_decl_column(0x05)
    9272                    
    9273                    $C$DW$792       .dwtag  DW_TAG_enumerator
    9274                            .dwattr $C$DW$792, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL2")
    9275                            .dwattr $C$DW$792, DW_AT_const_value(0x02)
    9276                            .dwattr $C$DW$792, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9277                            .dwattr $C$DW$792, DW_AT_decl_line(0xbc)
    9278                            .dwattr $C$DW$792, DW_AT_decl_column(0x05)
    9279                    
    9280                    $C$DW$793       .dwtag  DW_TAG_enumerator
    9281                            .dwattr $C$DW$793, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL3")
    9282                            .dwattr $C$DW$793, DW_AT_const_value(0x03)
    9283                            .dwattr $C$DW$793, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9284                            .dwattr $C$DW$793, DW_AT_decl_line(0xbd)
    9285                            .dwattr $C$DW$793, DW_AT_decl_column(0x05)
    9286                    
    9287                    $C$DW$794       .dwtag  DW_TAG_enumerator
    9288                            .dwattr $C$DW$794, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL4")
    9289                            .dwattr $C$DW$794, DW_AT_const_value(0x04)
    9290                            .dwattr $C$DW$794, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9291                            .dwattr $C$DW$794, DW_AT_decl_line(0xbe)
    9292                            .dwattr $C$DW$794, DW_AT_decl_column(0x05)
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  171

    9293                    
    9294                    $C$DW$795       .dwtag  DW_TAG_enumerator
    9295                            .dwattr $C$DW$795, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL5")
    9296                            .dwattr $C$DW$795, DW_AT_const_value(0x05)
    9297                            .dwattr $C$DW$795, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9298                            .dwattr $C$DW$795, DW_AT_decl_line(0xbf)
    9299                            .dwattr $C$DW$795, DW_AT_decl_column(0x05)
    9300                    
    9301                    $C$DW$796       .dwtag  DW_TAG_enumerator
    9302                            .dwattr $C$DW$796, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL6")
    9303                            .dwattr $C$DW$796, DW_AT_const_value(0x06)
    9304                            .dwattr $C$DW$796, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9305                            .dwattr $C$DW$796, DW_AT_decl_line(0xc0)
    9306                            .dwattr $C$DW$796, DW_AT_decl_column(0x05)
    9307                    
    9308                    $C$DW$797       .dwtag  DW_TAG_enumerator
    9309                            .dwattr $C$DW$797, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNEL7")
    9310                            .dwattr $C$DW$797, DW_AT_const_value(0x07)
    9311                            .dwattr $C$DW$797, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9312                            .dwattr $C$DW$797, DW_AT_decl_line(0xc1)
    9313                            .dwattr $C$DW$797, DW_AT_decl_column(0x05)
    9314                    
    9315                    $C$DW$798       .dwtag  DW_TAG_enumerator
    9316                            .dwattr $C$DW$798, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVDDS")
    9317                            .dwattr $C$DW$798, DW_AT_const_value(0x08)
    9318                            .dwattr $C$DW$798, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9319                            .dwattr $C$DW$798, DW_AT_decl_line(0xc2)
    9320                            .dwattr $C$DW$798, DW_AT_decl_column(0x05)
    9321                    
    9322                    $C$DW$799       .dwtag  DW_TAG_enumerator
    9323                            .dwattr $C$DW$799, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELDCOUPL")
    9324                            .dwattr $C$DW$799, DW_AT_const_value(0x09)
    9325                            .dwattr $C$DW$799, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9326                            .dwattr $C$DW$799, DW_AT_decl_line(0xc3)
    9327                            .dwattr $C$DW$799, DW_AT_decl_column(0x05)
    9328                    
    9329                    $C$DW$800       .dwtag  DW_TAG_enumerator
    9330                            .dwattr $C$DW$800, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELVSS")
    9331                            .dwattr $C$DW$800, DW_AT_const_value(0x0a)
    9332                            .dwattr $C$DW$800, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9333                            .dwattr $C$DW$800, DW_AT_decl_line(0xc4)
    9334                            .dwattr $C$DW$800, DW_AT_decl_column(0x05)
    9335                    
    9336                    $C$DW$801       .dwtag  DW_TAG_enumerator
    9337                            .dwattr $C$DW$801, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0CHANNELCOUNT")
    9338                            .dwattr $C$DW$801, DW_AT_const_value(0x0b)
    9339                            .dwattr $C$DW$801, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9340                            .dwattr $C$DW$801, DW_AT_decl_line(0xc6)
    9341                            .dwattr $C$DW$801, DW_AT_decl_column(0x05)
    9342                    
    9343                            .dwattr $C$DW$T$608, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    9344                            .dwattr $C$DW$T$608, DW_AT_decl_line(0xb9)
    9345                            .dwattr $C$DW$T$608, DW_AT_decl_column(0x0e)
    9346                            .dwendtag $C$DW$T$608
    9347                    
TI ARM Assembler PC v18.1.3 Thu Dec 13 17:43:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Volpone\AppData\Local\Temp\{A2291A30-4FA3-4779-9AB1-4151BB72FD2E} PAGE  172

    9348                    $C$DW$T$609     .dwtag  DW_TAG_typedef
    9349                            .dwattr $C$DW$T$609, DW_AT_name("CC1350_LAUNCHXL_ADCBuf0ChannelName")
    9350                            .dwattr $C$DW$T$609, DW_AT_type(*$C$DW$T$608)
    9351                            .dwattr $C$DW$T$609, DW_AT_language(DW_LANG_C)
    9352                            .dwattr $C$DW$T$609, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    9353                            .dwattr $C$DW$T$609, DW_AT_decl_line(0xc7)
    9354                            .dwattr $C$DW$T$609, DW_AT_decl_column(0x03)
    9355                    
    9356                    
    9357                    $C$DW$T$610     .dwtag  DW_TAG_enumeration_type
    9358                            .dwattr $C$DW$T$610, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    9359                            .dwattr $C$DW$T$610, DW_AT_byte_size(0x01)
    9360                    $C$DW$802       .dwtag  DW_TAG_enumerator
    9361                            .dwattr $C$DW$802, DW_AT_name("CC1350_LAUNCHXL_ADCBUF0")
    9362                            .dwattr $C$DW$802, DW_AT_const_value(0x00)
    9363                            .dwattr $C$DW$802, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9364                            .dwattr $C$DW$802, DW_AT_decl_line(0xb0)
    9365                            .dwattr $C$DW$802, DW_AT_decl_column(0x05)
    9366                    
    9367                    $C$DW$803       .dwtag  DW_TAG_enumerator
    9368                            .dwattr $C$DW$803, DW_AT_name("CC1350_LAUNCHXL_ADCBUFCOUNT")
    9369                            .dwattr $C$DW$803, DW_AT_const_value(0x01)
    9370                            .dwattr $C$DW$803, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC135
    9371                            .dwattr $C$DW$803, DW_AT_decl_line(0xb2)
    9372                            .dwattr $C$DW$803, DW_AT_decl_column(0x05)
    9373                    
    9374                            .dwattr $C$DW$T$610, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    9375                            .dwattr $C$DW$T$610, DW_AT_decl_line(0xaf)
    9376                            .dwattr $C$DW$T$610, DW_AT_decl_column(0x0e)
    9377                            .dwendtag $C$DW$T$610
    9378                    
    9379                    $C$DW$T$611     .dwtag  DW_TAG_typedef
    9380                            .dwattr $C$DW$T$611, DW_AT_name("CC1350_LAUNCHXL_ADCBufName")
    9381                            .dwattr $C$DW$T$611, DW_AT_type(*$C$DW$T$610)
    9382                            .dwattr $C$DW$T$611, DW_AT_language(DW_LANG_C)
    9383                            .dwattr $C$DW$T$611, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\examples\rtos\CC1
    9384                            .dwattr $C$DW$T$611, DW_AT_decl_line(0xb3)
    9385                            .dwattr $C$DW$T$611, DW_AT_decl_column(0x03)
    9386                    
    9387                    
    9388                    $C$DW$T$612     .dwtag  DW_TAG_enumeration_type
    9389                            .dwattr $C$DW$T$612, DW_AT_name("CC1350_LAUNCHXL_ADCName")
